In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages
Requirement already satisfied: python-dateutil>=2 in c:\users\user\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: pytz>=2011k in c:\users\user\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: numpy>=1.7.0 in c:\users\user\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2->pandas)

You are using pip version 9.0.1, however version 10.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [5]:
import numpy as np
import pandas as pd

一次元の配列を作る

In [6]:
s = pd.Series([1,2,np.nan])
s

0    1.0
1    2.0
2    NaN
dtype: float64

PythonやNumpyと同様、インデックスを利用して値を取り出すことができる

In [7]:
s[0]

1.0

合計値なども可能

In [8]:
s.sum()

3.0

二次元のリストをつくる

In [10]:
df = pd.DataFrame({
    "A":[1,2],
    "B":[3,4]
})
#pd.DataFrame({"A":[a,2],"B":[3,4]})
df

   A  B
0  1  3
1  2  4

データのタイプを調べる

In [12]:
df.dtypes

A    int64
B    int64
dtype: object

numpyのrandom.randnを使ってみる

In [13]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0 -1.318680 -1.718359 -0.437137 -0.650320
1 -1.158011  0.606800 -0.968614 -1.524670
2 -2.141570 -2.055722  1.235505 -0.087734
3 -0.353556 -1.464645  2.188662  0.296071
4  0.751706 -0.859606  0.261257  0.103587
5 -0.261683  0.362569 -0.721059 -0.743896

インデックスの表示を変える

In [18]:
df = pd.DataFrame(np.random.randn(6,4),index=pd.date_range("20180619",periods=6))
#pd.date_range(始まり、期間)
df

                   0         1         2         3
2018-06-19  1.746349  1.575836 -0.440470 -0.356865
2018-06-20 -0.911363 -0.458024  0.003614  0.290241
2018-06-21 -1.160585 -2.307277 -0.349011  0.920853
2018-06-22  0.548991 -0.035466  0.749575 -0.418116
2018-06-23  0.208058  0.284163  0.586649  0.505229
2018-06-24 -1.297698 -2.454652 -0.167001 -0.209573

さらにカラムの表示をかえる

In [25]:
df = pd.DataFrame(np.random.randn(6,4),index=pd.date_range("20180619",periods=6),columns=["A","B","C","D"])
#pd.date_range(始まり、期間)
df

                   A         B         C         D
2018-06-19  0.234911 -0.676922  0.360823  0.153287
2018-06-20  0.498731  0.528086 -0.367213  1.403734
2018-06-21  0.715894 -2.639517 -0.392039  0.284107
2018-06-22  1.739656 -0.271450  0.982952  0.483135
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700
2018-06-24  0.880432  0.278362  1.929638  0.468512

行を取り出す

以下だと行の一番目を取り出す

In [27]:
df.head(1)

                   A         B         C         D
2018-06-19  0.234911 -0.676922  0.360823  0.153287

下のデータを見たい場合、以下のようにする

下から2つ分のデータを見たいとき

In [30]:
df.tail(2)

                   A         B         C         D
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700
2018-06-24  0.880432  0.278362  1.929638  0.468512

インデックス部分のみを表示する

In [31]:
df.index

DatetimeIndex(['2018-06-19', '2018-06-20', '2018-06-21', '2018-06-22',
               '2018-06-23', '2018-06-24'],
              dtype='datetime64[ns]', freq='D')

反対にカラムを見たりする

In [32]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

データの値のみを取り出す

In [33]:
df.values

array([[ 0.23491129, -0.67692223,  0.36082342,  0.15328654],
       [ 0.49873125,  0.52808577, -0.36721306,  1.40373383],
       [ 0.71589388, -2.63951685, -0.39203879,  0.28410668],
       [ 1.73965641, -0.27145004,  0.98295238,  0.48313467],
       [-0.26465778,  0.39366229, -1.30951479, -1.25469972],
       [ 0.8804317 ,  0.27836186,  1.92963758,  0.46851176]])

データ全体を表示する

In [35]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.634161 -0.397963  0.200774  0.256346
std    0.674547  1.188279  1.147292  0.861115
min   -0.264658 -2.639517 -1.309515 -1.254700
25%    0.300866 -0.575554 -0.385832  0.185992
50%    0.607313  0.003456 -0.003195  0.376309
75%    0.839297  0.364837  0.827420  0.479479
max    1.739656  0.528086  1.929638  1.403734

Numpyと同様、転置もある

In [36]:
df.T

   2018-06-19  2018-06-20  2018-06-21  2018-06-22  2018-06-23  2018-06-24
A    0.234911    0.498731    0.715894    1.739656   -0.264658    0.880432
B   -0.676922    0.528086   -2.639517   -0.271450    0.393662    0.278362
C    0.360823   -0.367213   -0.392039    0.982952   -1.309515    1.929638
D    0.153287    1.403734    0.284107    0.483135   -1.254700    0.468512

カラムを指定してソートする

In [37]:
df.sort_values(by="A")

                   A         B         C         D
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700
2018-06-19  0.234911 -0.676922  0.360823  0.153287
2018-06-20  0.498731  0.528086 -0.367213  1.403734
2018-06-21  0.715894 -2.639517 -0.392039  0.284107
2018-06-24  0.880432  0.278362  1.929638  0.468512
2018-06-22  1.739656 -0.271450  0.982952  0.483135

スライスのように、要素を取り出すことができる

In [38]:
df[0:4]

                   A         B         C         D
2018-06-19  0.234911 -0.676922  0.360823  0.153287
2018-06-20  0.498731  0.528086 -0.367213  1.403734
2018-06-21  0.715894 -2.639517 -0.392039  0.284107
2018-06-22  1.739656 -0.271450  0.982952  0.483135

スライスと似た感じで、取り出す範囲の日付指定ができる

In [42]:
df["2018-06-20":"2018-06-22"]

                   A         B         C         D
2018-06-20  0.498731  0.528086 -0.367213  1.403734
2018-06-21  0.715894 -2.639517 -0.392039  0.284107
2018-06-22  1.739656 -0.271450  0.982952  0.483135

行を指定して、値を取り出す

In [43]:
df.loc["2018-06-19"]

A    0.234911
B   -0.676922
C    0.360823
D    0.153287
Name: 2018-06-19 00:00:00, dtype: float64

行を指定した後に、カラムを指定すると、特定の値を取得できる

In [45]:
df.loc["2018-06-19",["A","C"]]

A    0.234911
C    0.360823
Name: 2018-06-19 00:00:00, dtype: float64

上記のこととスライスを利用して、特定の期間の値を取得できる

In [47]:
df.loc["2018-06-19":"2018-06-22",["A","C"]]

                   A         C
2018-06-19  0.234911  0.360823
2018-06-20  0.498731 -0.367213
2018-06-21  0.715894 -0.392039
2018-06-22  1.739656  0.982952

全ての値を取り出したいときは、:を利用する

In [48]:
df.loc[:,["A","C"]]

                   A         C
2018-06-19  0.234911  0.360823
2018-06-20  0.498731 -0.367213
2018-06-21  0.715894 -0.392039
2018-06-22  1.739656  0.982952
2018-06-23 -0.264658 -1.309515
2018-06-24  0.880432  1.929638

df.locではなく、df.ilocで指定もできる

In [50]:
df.iloc[0:3,0:3]

                   A         B         C
2018-06-19  0.234911 -0.676922  0.360823
2018-06-20  0.498731  0.528086 -0.367213
2018-06-21  0.715894 -2.639517 -0.392039

ちょっとした条件式を使うことができる  
以下は、0より大きいものを表示する

In [51]:
df[df > 0]

                   A         B         C         D
2018-06-19  0.234911       NaN  0.360823  0.153287
2018-06-20  0.498731  0.528086       NaN  1.403734
2018-06-21  0.715894       NaN       NaN  0.284107
2018-06-22  1.739656       NaN  0.982952  0.483135
2018-06-23       NaN  0.393662       NaN       NaN
2018-06-24  0.880432  0.278362  1.929638  0.468512

条件に合わないものはNaNで表示される

次はCで0より大きいものを表示する

In [53]:
df[df.C > 0]

                   A         B         C         D
2018-06-19  0.234911 -0.676922  0.360823  0.153287
2018-06-22  1.739656 -0.271450  0.982952  0.483135
2018-06-24  0.880432  0.278362  1.929638  0.468512

Cで0より大きいものが表示されることが分かる

データフレームのコピーを作る

In [55]:
df2 = df.copy()

新しくカラムを追加する  
適当に値を入力する

In [56]:
df2["E"] = ["1","1","3","5","7","10"]

In [57]:
df2

                   A         B         C         D   E
2018-06-19  0.234911 -0.676922  0.360823  0.153287   1
2018-06-20  0.498731  0.528086 -0.367213  1.403734   1
2018-06-21  0.715894 -2.639517 -0.392039  0.284107   3
2018-06-22  1.739656 -0.271450  0.982952  0.483135   5
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700   7
2018-06-24  0.880432  0.278362  1.929638  0.468512  10

in　演算子のような使い方もできる  
Eのカラムで値が1または5の行を取り出す

In [59]:
df2[df2["E"].isin(["1","5"])]

                   A         B         C         D  E
2018-06-19  0.234911 -0.676922  0.360823  0.153287  1
2018-06-20  0.498731  0.528086 -0.367213  1.403734  1
2018-06-22  1.739656 -0.271450  0.982952  0.483135  5

新しくカラムを代入により追加することもできる

In [65]:
a1 = pd.Series([1,2,3,4,5,6,],index=(pd.date_range("20180619",periods=6)))

In [66]:
a1

2018-06-19    1
2018-06-20    2
2018-06-21    3
2018-06-22    4
2018-06-23    5
2018-06-24    6
Freq: D, dtype: int64

In [67]:
df

                   A         B         C         D   E
2018-06-19  0.234911 -0.676922  0.360823  0.153287 NaN
2018-06-20  0.498731  0.528086 -0.367213  1.403734 NaN
2018-06-21  0.715894 -2.639517 -0.392039  0.284107 NaN
2018-06-22  1.739656 -0.271450  0.982952  0.483135 NaN
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700 NaN
2018-06-24  0.880432  0.278362  1.929638  0.468512 NaN

dfにシリーズのa1を代入してカラムを追加する

In [68]:
df["E"] = a1

In [69]:
df

                   A         B         C         D  E
2018-06-19  0.234911 -0.676922  0.360823  0.153287  1
2018-06-20  0.498731  0.528086 -0.367213  1.403734  2
2018-06-21  0.715894 -2.639517 -0.392039  0.284107  3
2018-06-22  1.739656 -0.271450  0.982952  0.483135  4
2018-06-23 -0.264658  0.393662 -1.309515 -1.254700  5
2018-06-24  0.880432  0.278362  1.929638  0.468512  6

もちろん、インデックスにあったpd.date_rangeを指定しないとEにはNaNは入る

入力されたデータを一行下げる

In [70]:
df.shift(1)

                   A         B         C         D    E
2018-06-19       NaN       NaN       NaN       NaN  NaN
2018-06-20  0.234911 -0.676922  0.360823  0.153287  1.0
2018-06-21  0.498731  0.528086 -0.367213  1.403734  2.0
2018-06-22  0.715894 -2.639517 -0.392039  0.284107  3.0
2018-06-23  1.739656 -0.271450  0.982952  0.483135  4.0
2018-06-24 -0.264658  0.393662 -1.309515 -1.254700  5.0

データフレームをくっつけたい場合(カラム追加ではなく)、pd.concatを利用する

以下の配列を作る

In [72]:
df3 = pd.DataFrame(np.random.randn(3,3))
df4 = pd.DataFrame(np.random.randn(3,3))

In [73]:
df3

          0         1         2
0  0.808543  0.866694 -0.099636
1  1.001879  1.147878 -1.577494
2  1.266702 -0.578436  0.405628

In [74]:
df4

          0         1         2
0  1.185044 -0.821831  1.847137
1 -0.047036 -0.610160  1.132871
2 -0.160287  0.930943 -1.601175

df3とdf4をくっつける

In [76]:
pd.concat([df3,df4])

          0         1         2
0  0.808543  0.866694 -0.099636
1  1.001879  1.147878 -1.577494
2  1.266702 -0.578436  0.405628
0  1.185044 -0.821831  1.847137
1 -0.047036 -0.610160  1.132871
2 -0.160287  0.930943 -1.601175

最下段の行に新しく行を挿入する

In [80]:
df5 = pd.DataFrame(np.random.rand(8,4),columns=["A","B","C","D"])

In [81]:
df5

          A         B         C         D
0  0.640548  0.573252  0.244591  0.828008
1  0.157486  0.318270  0.784087  0.481458
2  0.095788  0.409031  0.266869  0.646802
3  0.769769  0.269215  0.600135  0.005683
4  0.488254  0.332897  0.035993  0.018667
5  0.024895  0.158789  0.806017  0.719154
6  0.736921  0.887603  0.337758  0.123322
7  0.171928  0.981033  0.266511  0.529223

最上段の行を取り出し、最下段に挿入する

In [83]:
a = df5.iloc[0]
a

A    0.640548
B    0.573252
C    0.244591
D    0.828008
Name: 0, dtype: float64

In [84]:
df5.append(a)

          A         B         C         D
0  0.640548  0.573252  0.244591  0.828008
1  0.157486  0.318270  0.784087  0.481458
2  0.095788  0.409031  0.266869  0.646802
3  0.769769  0.269215  0.600135  0.005683
4  0.488254  0.332897  0.035993  0.018667
5  0.024895  0.158789  0.806017  0.719154
6  0.736921  0.887603  0.337758  0.123322
7  0.171928  0.981033  0.266511  0.529223
0  0.640548  0.573252  0.244591  0.828008

0行目と8行目が同じものであることが分かる

appendをする際に、引数でignore_index=Trueを指定すると、インデックスの番号が連番となる

In [85]:
df5.append(a,ignore_index=True)

          A         B         C         D
0  0.640548  0.573252  0.244591  0.828008
1  0.157486  0.318270  0.784087  0.481458
2  0.095788  0.409031  0.266869  0.646802
3  0.769769  0.269215  0.600135  0.005683
4  0.488254  0.332897  0.035993  0.018667
5  0.024895  0.158789  0.806017  0.719154
6  0.736921  0.887603  0.337758  0.123322
7  0.171928  0.981033  0.266511  0.529223
8  0.640548  0.573252  0.244591  0.828008

グルーピングもできる

以下の配列を作る

In [94]:
df6 = pd.DataFrame({"A":["a","b","a","b","a"],"B":np.random.rand(5)})

In [95]:
df6

   A         B
0  a  0.134023
1  b  0.514572
2  a  0.054307
3  b  0.439922
4  a  0.433676

groupbyでグルーピングできる

In [99]:
df6.groupby("A").sum()

          B
A
a  0.622006
b  0.954495

In [100]:
#pip install pandas_datareader

In [ ]:
#import pandas_datareader

#dataframe = pandas_datareader.data.DataReader(arg1,arg3,arg3,)